#Использовать asserts

Перем юТест;
Перем Счетчик;


&Перед
Процедура ПередЗапускомТеста() Экспорт
	Счетчик = Новый Массив;
КонецПроцедуры

&Перед
Процедура ПередЗапускомТестаПервыйРаз() Экспорт
	Счетчик.Добавить("1");
КонецПроцедуры

&ПереД
Процедура ПередЗапускомТестаВторойРаз() Экспорт
    Счетчик.Добавить("2");
КонецПроцедуры
	
&После
Процедура ПослеЗапускаТестаВторойРаз() Экспорт
	Сообщить("ТестОкончил");
КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьВерсию() Экспорт
	Утверждения.ПроверитьРавенство("0.1", Версия());
	Ожидаем.Что(Счетчик.Количество()).Равно(2);
КонецПроцедуры


&тесТ
Процедура ТестДолжен_ПроверитьВерсиюЕщеРаз() Экспорт
	Утверждения.ПроверитьРавенство("0.1", Версия());
КонецПроцедуры

Функция Версия()
	Возврат "0.1";
КонецФункции
