#Использовать asserts

Перем юТест;

&тесТ
Процедура ПередЗапускомТеста() Экспорт
//TODO вставить в журнал для проверки последовательности вызова    
КонецПроцедуры


Процедура ПослеЗапускаТеста() Экспорт
//TODO вставить в журнал для проверки последовательности вызова    
КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьВерсию() Экспорт
//TODO вставить в журнал для проверки последовательности вызова    
	Утверждения.ПроверитьРавенство("0.1", Версия());
КонецПроцедуры

Функция Версия()
	Возврат "0.1";
КонецФункции
